/*
問題描述：
讀取四位數字的整數，並且按下序方式加密：

輸入說明：
輸入一組四位數字

輸出說明：
公式：
（該位數＋７）％１０取代每個數字。然後將第一個位數的數字和第三個位數的數字交換，將第二個位數的數字，和第四個位數的數字交換。

範例：

1234

0189
*/

#include <stdio.h>

int main()
{
    int n, a, b, c, d, temp;

    scanf("%d", &n);

    a = n/1000;
    b = (n%1000)/100;
    c = (n%100)/10;
    d = n%10;

    a = (a+7)%10;
    b = (b+7)%10;
    c = (c+7)%10;
    d = (d+7)%10;

    temp = a;
    a = c;
    c = temp;

    temp = b;
    b = d;
    d = temp;

    printf("%d%d%d%d\n", a, b, c, d);

    return 0;
}
